#+TITLE: Create a S3 Bucket to Host the Website Files
#+AUTHOR: Kyle M. Douglass
#+DATE: 2020-09-04
#+EMAIL: kyle.m.douglass@gmail.com

#+BEGIN_ABSTRACT
We discuss how to create a AWS S3 bucket using Terraform to serve static files for our website.
#+END_ABSTRACT

* Hosting a static website with AWS S3

A static website is a website whose files are already generated when a client requests them from a
web server. In contrast, a dynamic website generates files on-demand from a client. As an example
of the latter, consider a shopping cart on an e-commerce site. The shopping cart's contents will
vary depending on what the user has added to it. As a result, the page that displays the contents
has to be created dynamically by the server when the user requests to see it.

S3 is a simple choice for hosting static websites because S3 is fundamentally a remote object
store. It is also easy to configure to serve static sites. On the other hand, some features, such
as HTTP over TLS (https), require a bit more work to set up then one might expect.

In this report, we will briefly discuss how to create and configure a bucket to a serve static
website. And because we value automation, we will continue to use Terraform.

The versions of the tools that i used for this report are:

#+BEGIN_SRC sh :results output :exports results :session
terraform version | head -n 1
echo AWS Vault $(aws-vault --version)
~/venvs/aws/bin/aws --version
#+END_SRC

#+RESULTS:
: Terraform v0.12.24
: AWS Vault v5.3.2
: aws-cli/1.18.50 Python/3.7.5 Linux/5.4.0-42-generic botocore/1.17.21

